In [2]:
import numpy as np
import pandas as pd
from statsmodels.stats.libqsturng import psturng, qsturng

In [8]:
def SEDifference(n1, n2, MSE):
    return (1/np.sqrt(2))*np.sqrt(MSE*(1/n1+1/n2))#standard error difference formula

In [ ]:
name	mean	SD	N
Tillamook	0.0802	0.011349361	10
Newport	0.0748	0.008041921	8
Petersburg	0.103442857	0.015007032	7
Magadan	0.0780125	0.012108617	8
Tvarminne	0.0957	0.0118323	6

In [ ]:
#taken from https://www.biostathandbook.com/onewayanova.html

In [4]:
datastat=pd.read_clipboard()
datastat

         name      mean        SD   N
0   Tillamook  0.080200  0.011349  10
1     Newport  0.074800  0.008042   8
2  Petersburg  0.103443  0.015007   7
3     Magadan  0.078012  0.012109   8
4   Tvarminne  0.095700  0.011832   6

In [5]:
SSE=0 #SUM OF SQUARES ERROR
for i in range(len(datastat["SD"].values)):
    SSE1=(datastat["SD"].values[i])**2
    SSE2=(datastat["N"].values[i]-1)*SSE1 ##group df*group variance
    SSE=SSE+SSE2##sum

In [6]:
MSE=SSE/(sum(datastat["N"].values)-len(datastat["SD"].values)) #SSE/df MEAN SQUARED ERROR

In [9]:
output001=pd.DataFrame()
output1=pd.DataFrame()

for b in range(len(datastat["SD"].values)-1):
    c=b+1
    for d in range(c,len(datastat["SD"].values)):
        q=np.absolute(datastat["mean"].values[b]-datastat["mean"].values[d])/SEDifference(datastat["N"].values[b],datastat["N"].values[d],MSE) #mean difference/standard error difference
        output001['name1']=[datastat["name"].values[b]] # for some reason square brackets are absolutely neccessary
        output001['name2']=datastat["name"].values[d]
        output001['q']=q
        output001['p']=psturng(q, len(datastat["N"].values), (sum(datastat["N"].values)-len(datastat["N"].values))) #convert to p values
        output1=pd.concat([output1, output001])

In [10]:
output1

        name1       name2         q         p
0   Tillamook     Newport  1.370848  0.853661
0   Tillamook  Petersburg  5.679381  0.002689
0   Tillamook     Magadan  0.555321  0.900000
0   Tillamook   Tvarminne  3.614384  0.101991
0     Newport  Petersburg  6.664255  0.001000
0     Newport     Magadan  0.773678  0.900000
0     Newport   Tvarminne  4.660042  0.018313
0  Petersburg     Magadan  5.916812  0.001679
0  Petersburg   Tvarminne  1.675873  0.734922
0     Magadan   Tvarminne  3.943755  0.061553